УслугиЛокально/src/Documents/УстановкаТарифовНаУслуги/УстановкаТарифовНаУслуги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаТарифовНаУслуги</name>
  <registerRecords>InformationRegister.ТарифыНаУслуги</registerRecords>
  <attributes>
    <name>ДатаИзмененияТарифа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТарифНаГаз</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТарифНаЭлектроэнергию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТарифНаВоду</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТарифНаМусор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТарифНаИнтернет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

УслугиЛокально/src/InformationRegisters/ТарифыНаУслуги/ТарифыНаУслуги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТарифыНаУслуги</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ТарифНаГаз</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТарифНаЭлектроэнергию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТарифНаВоду</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТарифНаМусор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТарифНаИнтернет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДатаТарифа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УслугиЛокально/src/Documents/УстановкаТарифовНаУслуги/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ТарифыНаУслуги
	Движения.ТарифыНаУслуги.Записывать = Истина;
	Движение = Движения.ТарифыНаУслуги.Добавить();
	//Движение.Период = Дата;
	Движение.ДатаТарифа = ДатаИзмененияТарифа;
	Движение.ТарифНаГаз = ТарифНаГаз;
	Движение.ТарифНаЭлектроэнергию = ТарифНаЭлектроэнергию;
	Движение.ТарифНаВоду = ТарифНаВоду;
	Движение.ТарифНаМусор = ТарифНаМусор;
	Движение.ТарифНаИнтернет = ТарифНаИнтернет;
КонецПроцедуры
